OpenFOAM-10/tutorials/combustion/buoyantReactingFoam/Lagrangian/rivuletPanel/system/wallFilmRegion.topoSet
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    wallFilmFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   filmWalls;
    }
    {
        name    wallFilmFaces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet wallFilmFaceSet;
    }
);


// ************************************************************************* //
